const numberRegex = /-?\b(?:0|[1-9]\d*)(?:\.\d+)?\b|(?<=^|\s)\.\d+\b/g;
const numberRegex2 = /(?<=^|\s)-?(0|[1-9]\d*)?(\.?\d+)\b/g;

// эта регулярка находит виды чисел только в рамках задания

// Было сложно вычленять числа без целой части, например .15
// для этого добавлена часть (?<=^|\s) - положительный просмотр назад с условием начала строки или пробельного символа,
// так мы не захватываем пробельный символ, если он есть перед числом

// но есть и нюансы - например, строка 3.4.5 определится как 2 числа - 3.4 и 5
// 3.- определится как 3 (из-за границы слова \b)


const text = "The price is 100.5 dollars, -5 degrees, and version2 is out."; // [ '100.5', '-5' ]
const text2 = "Numbers like .5, -.7, 3.14, and 0.0 are here."; // [ '.5', '-7', '3.14', '0.0 ]
const text3 = "The file is v2.0, page 3, section 4.5, price $99.99."; // [ '0', '3', '4.5', '99.99' ]
const text4 = "Traps: 2a, a2, 3.4.5, 3.-, ..5, and 5.."; // [ '3.4', '5', '3', '5', '5' ]
const text5 = ".5 -40 0.34 .53 0 -0"; // [ '.5', '-40', '0.34', '.53', '0', '-0' ]

console.log(text.match(numberRegex));    // [ '100.5', '-5' ]
console.log(text2.match(numberRegex));   // [ '.5', '-7', '3.14', '0.0 ]
console.log(text3.match(numberRegex));   // [ '0', '3', '4.5', '99.99' ]
console.log(text4.match(numberRegex));   // [ '3.4', '5', '3', '5', '5' ]
console.log(text5.match(numberRegex));   // [ '.5', '-40', '0.34', '.53', '0', '-0' ]
